# Spanish Error Messages
# Usage: error.<ErrorCodeName>=Message text
# Use {0}, {1}, etc., for parameters passed to DomainException

# General Errors (from GeneralErrorCode)
error.GENERAL=Ocurri\u00F3 un error interno inesperado. Por favor, contacte a soporte.
error.CONSTRAINT_VIOLATION=Validaci\u00F3n fallida. Por favor, revise los datos ingresados.
error.DATA_TYPE_MISMATCH=Tipo de dato inv\u00E1lido para el par\u00E1metro ''{1}''. Se esperaba tipo ''{2}'', pero se recibi\u00F3 ''{0}''.
error.RESOURCE_NOT_FOUND=No se encontr\u00F3 {0} para el ID: {1}.
error.DUPLICATED_RESOURCE=Ya existe un recurso con el mismo {0} (''{1}'').
error.OPERATION_NOT_ALLOWED=La operaci\u00F3n solicitada no est\u00E1 permitida.
error.INVALID_DATA=Datos proporcionados inv\u00E1lidos. Por favor, revise los detalles.
error.INVALID_STATE=La operaci\u00F3n no se puede realizar debido al estado actual del recurso.
error.AUTHENTICATION_ERROR=Autenticaci\u00F3n fallida. Por favor, revise sus credenciales o token.
error.INSUFFICIENT_CONTEXT=Falta informaci\u00F3n de contexto requerida para completar la solicitud.

# Business Errors (from BusinessErrorCode)
error.ACTIVATION_FAILED=La activaci\u00F3n del negocio fall\u00F3 debido a prerrequisitos no cumplidos.
error.USER_ALREADY_LINKED=El usuario con email ''{0}'' ya est\u00E1 vinculado a un negocio.

# Tenant Errors (from TenantErrorCode)
error.TENANT_RESOLUTION_FAILED=Acceso denegado. No se pudo resolver el tenant para el identificador: {0}.
error.TENANT_SETUP_FAILED=Fall\u00F3 la configuraci\u00F3n de la infraestructura para el tenant: {0}.

# Operation Not Allowed Reasons (Specific messages for OPERATION_NOT_ALLOWED)
# Format: error.OPERATION_NOT_ALLOWED.<ReasonName>=Message text
# -- Brand Reasons --
error.OPERATION_NOT_ALLOWED.IS_DEFAULT_BRAND=No se puede realizar la operaci\u00F3n en la marca por defecto.
# -- Category Reasons --
error.OPERATION_NOT_ALLOWED.IS_DEFAULT_CATEGORY=No se puede realizar la operaci\u00F3n en la categor\u00EDa por defecto.
error.OPERATION_NOT_ALLOWED.HAS_SUBCATEGORIES=No se puede eliminar la categor\u00EDa porque tiene subcategor\u00EDas.
error.OPERATION_NOT_ALLOWED.ADD_SUBCATEGORY_TO_DEFAULT=No se puede agregar una subcategor\u00EDa a la categor\u00EDa por defecto.
error.OPERATION_NOT_ALLOWED.REACHED_MAX_DEPTH=No se puede agregar la subcategor\u00EDa, se exceder\u00EDa la profundidad m\u00E1xima ({0}).
# -- Supplier Reasons --
error.OPERATION_NOT_ALLOWED.IS_DEFAULT_SUPPLIER=No se puede realizar la operaci\u00F3n en el proveedor por defecto.
error.OPERATION_NOT_ALLOWED.CANNOT_DEACTIVATE_DEFAULT_SUPPLIER=No se puede desactivar el proveedor por defecto.
error.OPERATION_NOT_ALLOWED.SUPPLIER_HAS_PRODUCTS=No se puede eliminar el proveedor porque est\u00E1 asociado con {0} producto(s). Por favor, reasigne los productos primero.
# -- Business Reasons --
error.OPERATION_NOT_ALLOWED.NOT_AUTHORIZED_TO_MANAGE_USERS=No est\u00E1 autorizado para gestionar usuarios de este negocio.
error.OPERATION_NOT_ALLOWED.CANNOT_ASSIGN_ROLES=No se pueden asignar los roles solicitados. Roles inv\u00E1lidos: {0}.
error.OPERATION_NOT_ALLOWED.USER_LIMIT_REACHED=No se pueden agregar m\u00E1s usuarios. Se ha alcanzado el n\u00FAmero m\u00E1ximo de usuarios ({0}) para este negocio.

# Add other specific error messages as needed